[command]/home/runner/work/_temp/27697b14-61b6-4ea9-a2e0-ed34bc71483c/terraform-bin plan --var=env=dev

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_instance_profile.ec2_instance_profile will be created
  + resource "aws_iam_instance_profile" "ec2_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2_instance_profile_v6"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2_access_role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.s3_access_policy will be created
  + resource "aws_iam_policy" "s3_access_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow EC2 instance to access S3 bucket"
      + id               = (known after apply)
      + name             = "ec2_s3_access_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::com.amrit.terraform-backend.lf",
                          + "arn:aws:s3:::com.amrit.terraform-backend.lf/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.ec2_role will be created
  + resource "aws_iam_role" "ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2_access_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_s3_policy will be created
  + resource "aws_iam_role_policy_attachment" "attach_s3_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ec2_access_role"
    }

  # module.ec2_instance.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "var.instance_profile_name_dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2_access_s3_role_dev"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.ec2_instance.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow EC2 instance to access S3 bucket"
      + id               = (known after apply)
      + name             = "ec2_s3_access_policy_dev"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::com.amrit.terraform-backend.lf",
                          + "arn:aws:s3:::com.amrit.terraform-backend.lf/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ec2_instance.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2_access_s3_role_dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ec2_instance.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ec2_access_s3_role_dev"
    }

  # module.ec2_instance.aws_instance.amrit_amazon_server will be created
  + resource "aws_instance" "amrit_amazon_server" {
      + ami                                  = "ami-05ffe3c48a9991133"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "var.instance_profile_name_dev"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "amrit-lf"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Creator" = "amrit"
          + "Name"    = "EC2 Instance"
        }
      + tags_all                             = {
          + "Creator" = "amrit"
          + "Name"    = "EC2 Instance"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ec2_role_arn = (known after apply)
  + instance_id  = (known after apply)
  + instnace_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_instance_profile.ec2_instance_profile will be created%0A  + resource "aws_iam_instance_profile" "ec2_instance_profile" {%0A      + arn         = (known after apply)%0A      + create_date = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "ec2_instance_profile_v6"%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + role        = "ec2_access_role"%0A      + tags_all    = (known after apply)%0A      + unique_id   = (known after apply)%0A    }%0A%0A  # aws_iam_policy.s3_access_policy will be created%0A  + resource "aws_iam_policy" "s3_access_policy" {%0A      + arn              = (known after apply)%0A      + attachment_count = (known after apply)%0A      + description      = "Allow EC2 instance to access S3 bucket"%0A      + id               = (known after apply)%0A      + name             = "ec2_s3_access_policy"%0A      + name_prefix      = (known after apply)%0A      + path             = "/"%0A      + policy           = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:GetObject",%0A                          + "s3:PutObject",%0A                          + "s3:ListBucket",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::com.amrit.terraform-backend.lf",%0A                          + "arn:aws:s3:::com.amrit.terraform-backend.lf/*",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id        = (known after apply)%0A      + tags_all         = (known after apply)%0A    }%0A%0A  # aws_iam_role.ec2_role will be created%0A  + resource "aws_iam_role" "ec2_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ec2_access_role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.attach_s3_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "attach_s3_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ec2_access_role"%0A    }%0A%0A  # module.ec2_instance.aws_iam_instance_profile.this will be created%0A  + resource "aws_iam_instance_profile" "this" {%0A      + arn         = (known after apply)%0A      + create_date = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "var.instance_profile_name_dev"%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + role        = "ec2_access_s3_role_dev"%0A      + tags_all    = (known after apply)%0A      + unique_id   = (known after apply)%0A    }%0A%0A  # module.ec2_instance.aws_iam_policy.this will be created%0A  + resource "aws_iam_policy" "this" {%0A      + arn              = (known after apply)%0A      + attachment_count = (known after apply)%0A      + description      = "Allow EC2 instance to access S3 bucket"%0A      + id               = (known after apply)%0A      + name             = "ec2_s3_access_policy_dev"%0A      + name_prefix      = (known after apply)%0A      + path             = "/"%0A      + policy           = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:GetObject",%0A                          + "s3:PutObject",%0A                          + "s3:ListBucket",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::com.amrit.terraform-backend.lf",%0A                          + "arn:aws:s3:::com.amrit.terraform-backend.lf/*",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id        = (known after apply)%0A      + tags_all         = (known after apply)%0A    }%0A%0A  # module.ec2_instance.aws_iam_role.this will be created%0A  + resource "aws_iam_role" "this" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ec2_access_s3_role_dev"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # module.ec2_instance.aws_iam_role_policy_attachment.this will be created%0A  + resource "aws_iam_role_policy_attachment" "this" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ec2_access_s3_role_dev"%0A    }%0A%0A  # module.ec2_instance.aws_instance.amrit_amazon_server will be created%0A  + resource "aws_instance" "amrit_amazon_server" {%0A      + ami                                  = "ami-05ffe3c48a9991133"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + enable_primary_ipv6                  = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = "var.instance_profile_name_dev"%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "amrit-lf"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + region                               = "us-east-1"%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = (known after apply)%0A      + tags                                 = {%0A          + "Creator" = "amrit"%0A          + "Name"    = "EC2 Instance"%0A        }%0A      + tags_all                             = {%0A          + "Creator" = "amrit"%0A          + "Name"    = "EC2 Instance"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification (known after apply)%0A%0A      + cpu_options (known after apply)%0A%0A      + ebs_block_device (known after apply)%0A%0A      + enclave_options (known after apply)%0A%0A      + ephemeral_block_device (known after apply)%0A%0A      + instance_market_options (known after apply)%0A%0A      + maintenance_options (known after apply)%0A%0A      + metadata_options (known after apply)%0A%0A      + network_interface (known after apply)%0A%0A      + private_dns_name_options (known after apply)%0A%0A      + root_block_device (known after apply)%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + ec2_role_arn = (known after apply)%0A  + instance_id  = (known after apply)%0A  + instnace_arn = (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
